<?xml version="1.0" ?>
<net name="accmpeg" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 720, 1280"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="948" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="32, 3, 3, 3" size="3456"/>
			<output>
				<port id="0" names="948" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims6743" type="Const" version="opset1">
			<data element_type="f32" offset="3456" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="947" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Clip_3" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="509" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="951" type="Const" version="opset1">
			<data element_type="f32" offset="3584" shape="32, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="951" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_4/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_4/Dims6455" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="950" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Clip_7" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="514" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="954" type="Const" version="opset1">
			<data element_type="f32" offset="4864" shape="16, 32, 1, 1" size="2048"/>
			<output>
				<port id="0" names="954" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_8/Dims6833" type="Const" version="opset1">
			<data element_type="f32" offset="6912" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="953" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="957" type="Const" version="opset1">
			<data element_type="f32" offset="6976" shape="96, 16, 1, 1" size="6144"/>
			<output>
				<port id="0" names="957" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_9/Dims6587" type="Const" version="opset1">
			<data element_type="f32" offset="13120" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="956" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Clip_12" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" names="521" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="960" type="Const" version="opset1">
			<data element_type="f32" offset="13504" shape="96, 1, 1, 3, 3" size="3456"/>
			<output>
				<port id="0" names="960" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_13/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_13/Dims6443" type="Const" version="opset1">
			<data element_type="f32" offset="16960" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="959" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Clip_16" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="526" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="963" type="Const" version="opset1">
			<data element_type="f32" offset="17344" shape="24, 96, 1, 1" size="9216"/>
			<output>
				<port id="0" names="963" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_17/Dims6437" type="Const" version="opset1">
			<data element_type="f32" offset="26560" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="962" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="966" type="Const" version="opset1">
			<data element_type="f32" offset="26656" shape="144, 24, 1, 1" size="13824"/>
			<output>
				<port id="0" names="966" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_18/Dims6719" type="Const" version="opset1">
			<data element_type="f32" offset="40480" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="965" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Clip_21" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="533" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="969" type="Const" version="opset1">
			<data element_type="f32" offset="41056" shape="144, 1, 1, 3, 3" size="5184"/>
			<output>
				<port id="0" names="969" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_22/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_22/Dims6539" type="Const" version="opset1">
			<data element_type="f32" offset="46240" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="968" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Clip_25" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="538" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="972" type="Const" version="opset1">
			<data element_type="f32" offset="46816" shape="24, 144, 1, 1" size="13824"/>
			<output>
				<port id="0" names="972" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_26/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_26/Dims6737" type="Const" version="opset1">
			<data element_type="f32" offset="60640" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="971" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Add_27" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="541" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="975" type="Const" version="opset1">
			<data element_type="f32" offset="60736" shape="144, 24, 1, 1" size="13824"/>
			<output>
				<port id="0" names="975" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_28/Dims6599" type="Const" version="opset1">
			<data element_type="f32" offset="74560" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="974" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Clip_31" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="546" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="978" type="Const" version="opset1">
			<data element_type="f32" offset="75136" shape="144, 1, 1, 3, 3" size="5184"/>
			<output>
				<port id="0" names="978" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_32/Dims6635" type="Const" version="opset1">
			<data element_type="f32" offset="80320" shape="1, 144, 1, 1" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="977" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Clip_35" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="551" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="981" type="Const" version="opset1">
			<data element_type="f32" offset="80896" shape="32, 144, 1, 1" size="18432"/>
			<output>
				<port id="0" names="981" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_36/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_36/Dims6467" type="Const" version="opset1">
			<data element_type="f32" offset="99328" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="980" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="984" type="Const" version="opset1">
			<data element_type="f32" offset="99456" shape="192, 32, 1, 1" size="24576"/>
			<output>
				<port id="0" names="984" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_37/Dims6671" type="Const" version="opset1">
			<data element_type="f32" offset="124032" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="983" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Clip_40" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="558" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="987" type="Const" version="opset1">
			<data element_type="f32" offset="124800" shape="192, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="987" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_41/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_41/Dims6575" type="Const" version="opset1">
			<data element_type="f32" offset="131712" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="986" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Clip_44" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="563" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="990" type="Const" version="opset1">
			<data element_type="f32" offset="132480" shape="32, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="990" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_45/Dims6791" type="Const" version="opset1">
			<data element_type="f32" offset="157056" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_45" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="989" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Add_46" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="566" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="993" type="Const" version="opset1">
			<data element_type="f32" offset="157184" shape="192, 32, 1, 1" size="24576"/>
			<output>
				<port id="0" names="993" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_47/Dims6725" type="Const" version="opset1">
			<data element_type="f32" offset="181760" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_47" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="992" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Clip_50" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="571" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="996" type="Const" version="opset1">
			<data element_type="f32" offset="182528" shape="192, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="996" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_51/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_51/Dims6713" type="Const" version="opset1">
			<data element_type="f32" offset="189440" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="995" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Clip_54" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="576" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="999" type="Const" version="opset1">
			<data element_type="f32" offset="190208" shape="32, 192, 1, 1" size="24576"/>
			<output>
				<port id="0" names="999" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_55/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_55/Dims6665" type="Const" version="opset1">
			<data element_type="f32" offset="214784" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_55" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="998" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Add_56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="579" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="1002" type="Const" version="opset1">
			<data element_type="f32" offset="214912" shape="192, 32, 1, 1" size="24576"/>
			<output>
				<port id="0" names="1002" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_57/Dims6767" type="Const" version="opset1">
			<data element_type="f32" offset="239488" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1001" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Clip_60" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="584" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="1005" type="Const" version="opset1">
			<data element_type="f32" offset="240256" shape="192, 1, 1, 3, 3" size="6912"/>
			<output>
				<port id="0" names="1005" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_61/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_61/Dims6797" type="Const" version="opset1">
			<data element_type="f32" offset="247168" shape="1, 192, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_61" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1004" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Clip_64" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="589" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="1008" type="Const" version="opset1">
			<data element_type="f32" offset="247936" shape="64, 192, 1, 1" size="49152"/>
			<output>
				<port id="0" names="1008" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_65/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_65/Dims6689" type="Const" version="opset1">
			<data element_type="f32" offset="297088" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_65" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1007" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1011" type="Const" version="opset1">
			<data element_type="f32" offset="297344" shape="384, 64, 1, 1" size="98304"/>
			<output>
				<port id="0" names="1011" precision="FP32">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_66/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_66/Dims6653" type="Const" version="opset1">
			<data element_type="f32" offset="395648" shape="1, 384, 1, 1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1010" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Clip_69" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="596" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="1014" type="Const" version="opset1">
			<data element_type="f32" offset="397184" shape="384, 1, 1, 3, 3" size="13824"/>
			<output>
				<port id="0" names="1014" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_70/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_70/Dims6545" type="Const" version="opset1">
			<data element_type="f32" offset="411008" shape="1, 384, 1, 1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_70" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1013" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Clip_73" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="601" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="1017" type="Const" version="opset1">
			<data element_type="f32" offset="412544" shape="64, 384, 1, 1" size="98304"/>
			<output>
				<port id="0" names="1017" precision="FP32">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_74/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
